// © Copyright 2004-2010, 2015 HP Development Company, L.P.

TaskName = "Firmware aktualisieren";

// Errors
FileOpenError = "Datei %@ kann nicht geöffnet werden.";
FileOpenErrorExplanation = "Diese Datei ist entweder beschädigt, oder sie wurde an einen anderen Speicherort verschoben, umbenannt oder gelöscht. Überprüfen Sie den Dateispeicherort, oder wählen Sie eine andere Datei aus, und versuchen Sie es noch einmal.";
PrintChannelOpenError = "Ein Druckerchannel kann nicht geöffnet werden.";
PrintChannelOpenErrorExplanation = "Überprüfen Sie, ob der Drucker korrekt angeschlossen und eingeschaltet ist. Versuchen Sie es dann noch einmal.";
SendDataError = "Die Daten können nicht an den Drucker gesendet werden.";
SendDataErrorExplanation = "Überprüfen Sie, ob der Drucker korrekt angeschlossen und eingeschaltet ist. Versuchen Sie es dann noch einmal.";

SomePenErrorTitle = "Firmware kann nicht aktualisiert werden.";
DoorOpenMsg = "Firmware kann nicht aktualisiert werden, weil eine Abdeckung offen ist. Schließen Sie alle Abdeckungen am Drucker.";

// Aquamarine Errors
FileCheckError = "Firmware kann nicht aktualisiert werden.";
FileCheckErrorExplanation = "Das Firmwarepaket ist ungültig. Wählen Sie eine andere Datei aus, und versuchen Sie es noch einmal.";

OkButton = "Ok";
CancelButton = "Abbrechen";
FirmwareUpdateTitle = "Firmwareupdate";
FirmwareUpdateDeviceState = "Wird gedruckt";
FirmwareUpdateCancelingDeviceState = "Wird abgebrochen";

// Great Wall Messages
PrinterIdleWarning = "Das Firmwareupdate schlägt u.U. fehl, wenn der Drucker in Verwendung ist (z.B. Druckauftrag oder Kalibrierung).\n\nStellen Sie vor dem Durchführen des Firmwareupdates sicher, dass der Drucker nicht verwendet wird.";
UpdateSuccessful = "Die Firmwaredatei wurde hochgeladen, und der Drucker wird nun aktualisiert.\n\nNach Abschluss des Firmwareupdates wird der Drucker automatisch neu gestartet.";
InvalidPackage = "Es liegen Probleme mit der Firmwaredatei vor. Das Firmwareupdate wurde nicht erfolgreich abgeschlossen. Das Problem wurde u.U. durch einen Übertragungsfehler verursacht.\n\nFühren Sie das Firmwareupdate erneut aus.\nWenden Sie sich an die HP Kundenbetreuung, wenn das Problem weiterhin besteht.";
FailedDependencies = "Das Firmwareupdate wurde aufgrund eines Abhängigkeitenproblems nicht erfolgreich abgeschlossen.\n\n%@ ist die aktuelle Firmwareversion, und Sie versuchen, %@ zu installieren.\n\nAuf der folgenden Webseite finden Sie das geeignete Update für diesen Drucker:\n%@.";
NotNow = "Das Firmwareupdate wurde nicht erfolgreich abgeschlossen, da der Drucker in Verwendung ist (z.B. mit der Verarbeitung oder dem Drucken eines Auftrags).\n\nStellen Sie sicher, dass der Drucker nicht in Verwendung ist, und führen Sie das Firmwareupdate erneut aus.";
TransmissionError = "Das Firmwareupdate wurde aufgrund von Übertragungsproblemen nicht erfolgreich abgeschlossen.\n\nPrüfen Sie die Verbindung des Druckers, und versuchen Sie es erneut.";
LicenseNotAccepted = "Das Firmwareupdate wurde aufgrund einer nicht akzeptierten Lizenz nicht durchgeführt.";
FatalError = "Das Firmwareupdate wurde aufgrund von Problemen nicht erfolgreich abgeschlossen.\n\nWenden Sie sich an die HP Kundenbetreuung, wenn das Problem weiterhin besteht.";

// layout
TaskTitle = "Firmware aktualisieren";
TaskDescription = "Wählen Sie eine Datei mit einem Firmwareupdate aus, und senden Sie diese Datei an den Drucker, um diesen zu aktualisieren.";
FileNameTitle = "Dateiname:";
FileNameField = "<Nicht ausgewählt>";
ChooseButton = "Auswählen…";
UpdateButton = "Aktualisieren";
ProgressPanel = "Status wird aktualisiert";
FirmwareUpdateProcessTitle = "Wird aktualisiert…";
